# Data Load and Exploration

## Practical Example: Auto.csv

### 1. Loading the Auto.csv dataset with Pandas

Import the pandas library.

!pip install pandas

In [8]:
import pandas as pd
import numpy as np

In [9]:
df=pd.read_csv('Auto.csv')
df['mpg'] - df['cylinders']
len(df['mpg']) == len(df['cylinders'])
np.array([1,2,3,4]) - np.array([1,1,1,1])

array([0, 1, 2, 3])

Use pandas' `read_csv` function to load the data in the file Auto.csv as a dataframe. This file has to be in the *same folder* as your notebook, otherwise you have to specify its full file path. Further details on how to use this function can be found in the [documentation][1] of `pandas.read_csv`.

**Important:** Please note that the column "horsepower" has some missing values that are marked with a question mark "?". Hence, we need to let pandas know that cells with a question mark are to be interpreted as a missing value. The way that missing values are indicated is different for different dataset (e.g. NA, N/A, n/a, -1, etc).

[1]: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

In [9]:
df_auto = pd.read_csv("Auto.csv", na_values='?')

Confirm that `df_auto` is a pandas DataFrame.

In [14]:
type(df_auto['mpg'])

pandas.core.series.Series

### 2. Exploring the df_auto dataframe with Pandas

Display the first three rows of the dataframe "df_auto" using the `head` command.

In [6]:
df_auto.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,1,plymouth satellite

Display the last three rows of the dataframe "df_auto" using the `tail` command.

In [7]:
df_auto.tail(6)

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
391,27.0,4,151.0,90.0,2950,17.3,82,1,chevrolet camaro
392,27.0,4,140.0,86.0,2790,15.6,82,1,ford mustang gl
393,44.0,4,97.0,52.0,2130,24.6,82,2,vw pickup
394,32.0,4,135.0,84.0,2295,11.6,82,1,dodge rampage
395,28.0,4,120.0,79.0,2625,18.6,82,1,ford ranger
396,31.0,4,119.0,82.0,2720,19.4,82,1,chevy s-10

Get the number of rows (length) of the dataframe.

In [6]:
len(df_auto['mpg'])

397

Get an overview of the structure of the dataframe.

In [16]:
df_auto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           397 non-null    float64
 1   cylinders     397 non-null    int64
 2   displacement  397 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        397 non-null    int64
 5   acceleration  397 non-null    float64
 6   year          397 non-null    int64
 7   origin        397 non-null    int64
 8   name          397 non-null    object
dtypes: float64(4), int64(4), object(1)
memory usage: 28.0+ KB

In [9]:
type(df_auto.horsepower)

pandas.core.series.Series

In [9]:
df_auto[['origin', 'year', 'mpg']].describe()

           origin        year         mpg
count  397.000000  397.000000  397.000000
mean     1.574307   75.994962   23.515869
std      0.802549    3.690005    7.825804
min      1.000000   70.000000    9.000000
25%      1.000000   73.000000   17.500000
50%      1.000000   76.000000   23.000000
75%      2.000000   79.000000   29.000000
max      3.000000   82.000000   46.600000

### 3. Data types in the dataframe with Pandas

Get an overview of the columns that are in the dataframe.

In [10]:
print("This is the df_auto.columns = \n{}. \nThis is the df_auto.columns' length = {}".format(df_auto.columns, len(df_auto.columns)))

This is the df_auto.columns =
Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'year', 'origin', 'name'],
      dtype='object').
This is the df_auto.columns' length = 9

In [11]:
df_auto.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'year', 'origin', 'name'],
      dtype='object')

Let's check the data types of the columns in the dataframe.

In [21]:
df_auto.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
year              int64
origin            int64
name             object
dtype: object

From the documentation of the Auto.csv dataset, we know that the column 'origin' is actually a categorical variable (not a numerical variable). Hence, we need to adjust this by replacing the numerical placeholders with the actual values. We can then check the data type of 'origin' again and see that it is now correctly classified as a category.

In [24]:
df_auto.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'year', 'origin', 'name'],
      dtype='object')

In [17]:
cleanup_nums = {"origin": {1:"American", 2:"European", 3:"Japanese"}}
df_auto.replace(cleanup_nums, inplace=True)

df_auto['origin'] = df_auto['origin'].astype('category')
df_auto['origin'].dtype

CategoricalDtype(categories=['American', 'European', 'Japanese'], ordered=False)

Get some futher information and summary statistics of the dataframe.

In [18]:
df_auto.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year
count,397.000000,397.000000,397.000000,392.000000,397.000000,397.000000,397.000000
mean,23.515869,5.458438,193.532746,104.469388,2970.261965,15.555668,75.994962
std,7.825804,1.701577,104.379583,38.491160,847.904119,2.749995,3.690005
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.000000,75.000000,2223.000000,13.800000,73.000000
50%,23.000000,4.000000,146.000000,93.500000,2800.000000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3609.000000,17.100000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

### 4. Filtering a dataframe with Pandas
#### Slice notation
Using **slice notation**: `df[start:stop]` selects items from start through stop-1. If start or end are omitted, the default is the very start and the very end of the dataframe. Selecting the first row of the dataframe:

In [16]:
df_auto[1:3] # Alternatively: df_auto.head(1)

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
1,15.0,8,350.0,165.0,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,1,plymouth satellite

If we provide a negative index, this means we are counting from backwards from the very end. Selecting the last two rows of the dataframe:

In [19]:
df_auto[-5:-1]

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
392,27.0,4,140.0,86.0,2790,15.6,82,1,ford mustang gl
393,44.0,4,97.0,52.0,2130,24.6,82,2,vw pickup
394,32.0,4,135.0,84.0,2295,11.6,82,1,dodge rampage
395,28.0,4,120.0,79.0,2625,18.6,82,1,ford ranger

Selecting the three rows before the last two:

In [13]:
df_auto[-5:-2]

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
392,27.0,4,140.0,86.0,2790,15.6,82,1,ford mustang gl
393,44.0,4,97.0,52.0,2130,24.6,82,2,vw pickup
394,32.0,4,135.0,84.0,2295,11.6,82,1,dodge rampage

#### Filter by column values
We can filter by one or more column values. For example, selecting all cars that run more than 44 miles per gallon:

In [20]:
df_auto[df_auto['mpg']>44]

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
322,46.6,4,86.0,65.0,2110,17.9,80,3,mazda glc
325,44.3,4,90.0,48.0,2085,21.7,80,2,vw rabbit c (diesel)
329,44.6,4,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl

Multiple conditions can be combined using logical and (`&`) as well as logical or (`|`):

In [14]:
df_auto[(df_auto.year == 70) & (df_auto.horsepower<90)]

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
17,21.0,6,200.0,85.0,2587,16.0,70,1,ford maverick
18,27.0,4,97.0,88.0,2130,14.5,70,3,datsun pl510
19,26.0,4,97.0,46.0,1835,20.5,70,2,volkswagen 1131 deluxe sedan
20,25.0,4,110.0,87.0,2672,17.5,70,2,peugeot 504

#### Selecting columns
We can select specific columns that we're interested in. For example, let's look only at car year, origin, and name:

In [31]:
df_auto[['year','origin','name']].head(5)

   year  origin                       name
0    70       1  chevrolet chevelle malibu
1    70       1          buick skylark 320
2    70       1         plymouth satellite
3    70       1              amc rebel sst
4    70       1                ford torino

#### Putting everything together
Filtering European cars more than 4 cylinders, selecting three columns, and then the first five rows.

In [30]:
df_auto[(df_auto.cylinders>4)&(df_auto.origin=="European")][['name','horsepower','year']][:5]

                   name  horsepower  year
211  mercedes-benz 280s       120.0    76
274           audi 5000       103.0    78
275         volvo 264gl       125.0    78
277       peugeot 604sl       133.0    78
297  mercedes benz 300d        77.0    79

### 5. Creating a new variable from an existing variable

Based on the name of the car we can determine the manufacturer

In [34]:
df_auto.name[:6]

0    chevrolet chevelle malibu
1            buick skylark 320
2           plymouth satellite
3                amc rebel sst
4                  ford torino
5             ford galaxie 500
Name: name, dtype: object

In [27]:
df_auto["manufacturer"] = df_auto["name"].str.split(" ", n=1, expand=True)[0]

Let's check the consistency of the manufacturer naming. We can spot some inconsistencies (e.g. "vokswagen" and "vw" instead of "volkswagen", "maxda" instead of "mazda", "chevroelt" and "chevy" instead of "chevrolet", "hi" instead of "ihc"). Also, the capri, mercury capri, and other models by mercury are actually produced by ford. Hence, we also correct this.

In [59]:
df_auto["manufacturer"].value_counts()

ford             51
chevrolet        43
plymouth         31
dodge            28
amc              27
toyota           25
datsun           23
buick            17
pontiac          16
volkswagen       15
honda            13
mercury          11
mazda            10
oldsmobile       10
fiat              8
peugeot           8
audi              7
vw                6
chrysler          6
volvo             6
renault           5
subaru            4
saab              4
opel              4
chevy             3
maxda             2
mercedes-benz     2
bmw               2
cadillac          2
chevroelt         1
triumph           1
capri             1
hi                1
vokswagen         1
mercedes          1
toyouta           1
nissan            1
Name: manufacturer, dtype: int64

Let's check these inconsistencies and try again

In [28]:
df_auto['manufacturer'] = df_auto['manufacturer'].replace(['vokswagen','vw'],'volkswagen')
df_auto['manufacturer'] = df_auto['manufacturer'].replace(['maxda'],'mazda')
df_auto['manufacturer'] = df_auto['manufacturer'].replace(['chevroelt','chevy'],'chevrolet')
df_auto['manufacturer'] = df_auto['manufacturer'].replace(['toyouta'],'toyota')
df_auto['manufacturer'] = df_auto['manufacturer'].replace(['mercedes'],'mercedes-benz')
df_auto['manufacturer'] = df_auto['manufacturer'].replace(['mercury','capri'],'ford')
df_auto['manufacturer'] = df_auto['manufacturer'].replace(['hi'],'ihc')

df_auto["manufacturer"].value_counts()

ford             63
chevrolet        47
plymouth         31
dodge            28
amc              27
toyota           26
datsun           23
volkswagen       22
buick            17
pontiac          16
honda            13
mazda            12
oldsmobile       10
peugeot           8
fiat              8
audi              7
chrysler          6
volvo             6
renault           5
subaru            4
saab              4
opel              4
mercedes-benz     3
bmw               2
cadillac          2
triumph           1
ihc               1
nissan            1
Name: manufacturer, dtype: int64